/** ЗАДАЧА - Стрелочная функция
 *
 * 1. Объявите переменную и присвойте ей стрелочную функцию
 *
 * 2. У функции не должно быть параметров
 *
 * 3. Явно верните из функции строку "Привет, мир!"
 *
 * 4. Вызовите функцию и выведите результат в консоль
 *
 * 5. Перепишите функцию так, чтобы результат возвращался неявно
 *
 */

// Явный вовзврат результата функции (explicit)
const helloWorld1 = () => {
  return "Привет, мир!";
};

// НЕявный вовзврат результата функции
const helloWorld2 = () => "Привет, мир!";

console.log(helloWorld1());
console.log(helloWorld2());
