/** ЗАДАЧА - Остаток от деления
 *
 * 1. Выведите в консоль остаток от деления "myNumber1" на "myNumber2".
 *
 * 2. Какой приоритет и ассоциативность
 * имеет оператор остаток от деления?
 *
 * 3. Проверьте ассоциативность самостоятельно
 *
 */

const myNumber1 = 10; // 10 = 3 + 3 + 3 + 1
const myNumber2 = 3;

// Моё решение

const result = myNumber1 % myNumber2;
console.log(result);

// ------------------------------------------------------ //

// Решение с урока

console.log(myNumber1 % myNumber2);

/**
 * https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Operators/Operator_precedence
 *
 * Приоритетность оператора % - 13 (выше, чем у операторов + и -)
 *
 * Ассоциативность определяет порядок, в котором обрабатываются операторы с одинаковым приоритетом
 * Ассоциативность оператора % - left-to-right (слева направо)
 */

console.log(((100 % 23) % 5) % 3);
